Revit 2027 API
BuiltInFailures.SketchFailures.InvalidSketchError Property
 Sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSketchError { get; }
Public Shared ReadOnly Property InvalidSketchError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSketchError {
	FailureDefinitionId^ get ();
}
static member InvalidSketchError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace